Revit 2024 API
SymbolTypeId.Kgf Property
 Symbol kgf, indicating unit Kilograms force.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId Kgf { get; }
Visual Basic
Public Shared ReadOnly Property Kgf As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ Kgf {
	ForgeTypeId^ get ();
}
See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace